[
  {
    "title": "Customer Strategy Director",
    "summary": "As a vital member and leader of the Customer Strategy team, the Customer Strategy Director provides direction to members of the Customer Strategy team and works closely with executive leadership to identify, influence and implement customer-centered growth initiatives. The Customer Strategy team is part of the Strategy & Customer Insights group (which also includes the Customer Analytics, Customer Research, and Performance Measurement teams) and works with all parts of the organization including Marketing, Merchandising, and Store Operations to create customer-driven growth initiatives. Candidates will need to demonstrate the ability to initiate and then lead multiple efforts that (a) generate customer insights from available data sources (e.g., customer databases, primary market research, etc.), (b) use those insights as the basis for generating new corporate initiatives, and (c) initiate and oversee these change initiatives within the organization.",
    "responsibilities": [
      "Coordinates with VP of Customer Strategy, EVP of Strategy and Customer Insights, and the broad executive team, to identify and prioritize areas for analysis.",
      "Applies analytical rigor to complex business issues and translates customer insights into financially viable retail initiatives.",
      "Collaborates with Customer Analytics, Customer Research and Performance Measurement teams to identify, execute against and measure business improvement opportunities.",
      "Designs and executes pilot programs to empirically test new business concepts Synthesizes disparate information into pragmatic insights, and translates insights into action.",
      "Leads and prioritizes cross-functional team activities.",
      "Coaches and develops Customer Strategy team members.",
      "Develops and presents communications (e.g., research findings, project recommendations) to senior management.",
      "Builds relationships with senior level executives throughout organization and establishes themselves as business partner in the development of customer-based growth initiatives."
    ],
    "requirements": [
      "Highly skilled in problem solving especially in situations of high ambiguity.",
      "Ability to apply analytical and quantitative rigor to understand complex business scenarios.",
      "Active curiosity?Must enjoy gathering and digging deeply into data to identify issues and solve problems.",
      "Leads and prioritizes cross-functional team activities.",
      "Strong work ethic complemented by a positive, can-do attitude.",
      "Proficiency in a broad array of marketing, advertising, and sales disciplines including direct marketing, CRM, sales force management/effectiveness, telemarketing, advertising, and loyalty programs.",
      "Extensive project planning and management experience leading cross-functional teams to successfully implement enterprise wide initiatives.",
      "Familiarity with standard customer insights techniques: qualitative (e.g., focus groups, user experience) and quantitative market research (e.g., surveys), marketing analytics (e.g., marketing ROI, marketing spend effectiveness), statistical (e.g., regression, CHAID) and economic (e.g., financial forecasting) modeling, customer segmentation (e.g., behavioral, needs/attitudinal), and customer profitability analysis (lifetime value).",
      "Extensive project planning and management experience leading cross-functional teams to successfully implement enterprise wide initiatives.",
      "Excellent PowerPoint and Excel skills.",
      "5-8 years professional experience in: CRM (non-technical fields), management consulting, retail (store operations, merchandising), marketing, or strategic analysis.",
      "Bachelors degree from four year college or university; MBA or other advanced degree strongly preferred."
    ],
    "location": "Chicago area"
  },
  {
    "title": "Customer Strategy Manager",
    "summary": "As a vital member of the Customer Strategy team, the Customer Strategy Manager provides works closely with executive leadership to identify, influence and implement customer-centered growth initiatives for my client. The Customer Strategy team is part of the broader Strategy & Customer Insights group (which also includes the Customer Analytics, Customer Research, and Performance Measurement teams) and works with all parts of the organization including Marketing, Merchandising, and Store Operations to create customer-driven growth initiatives. Candidates will need to demonstrate the ability to initiate and then lead efforts that (a) generate customer insights from available customer data sources (e.g., customer databases, primary market research, etc.), (b) use those insights as the basis for generating new corporate initiatives, and (c) initiate and oversee these change initiatives within the organization. \n The Customer Strategy Manager will partner with the other teams within the Strategy & Customer Insights group including Customer Analytics, Customer Research, and Performance Measurement and with the broader organization including Marketing, Merchandising, and Store Operations. The Customer Strategy Manager will leverage the existing work by their partners in the Strategy & Customer Insights group as well as initiate new insight development efforts; the latter could span the identification/development of new data sources to applying new insight development approaches to existing data. These efforts by the Customer Strategy Manager are expected to lead to specific customer-driven growth initiatives (e.g., multi-channel direct marketing, store-level merchandising strategy, marketing spend effectiveness). Finally, they will be active leaders of these initiatives as they are taken from concept, through testing, to final implementation. Once proven out, these initiative will then be handed off to their long-term business owners in the organization (e.g., marketing).",
    "responsibilities": [
      "Coordinates with VP of Customer Strategy and EVP of Strategy and Customer Insights, and the broad executive team, to identify and prioritize areas for analysis.",
      "Applies analytical rigor to complex business issues and translates customer insights into financially viable retail initiatives.",
      "Collaborates with Customer Analytics, Customer Research and Performance Measurement teams to identify, execute against and measure business improvement opportunities.",
      "Designs and executes pilot programs to empirically test new business concepts Synthesizes disparate information into pragmatic insights, and translates insights into action.",
      "Leads and prioritizes cross-functional team activities.",
      "Coaches and develops Customer Strategy team members.",
      "Collaborates with Customer Analytics, Customer Research and Performance Measurement teams to identify, execute against and measure business improvement opportunities.",
      "Designs and executes pilot programs to empirically test new business concepts.",
      "Synthesizes disparate information into pragmatic insights, and translates insights into action.",
      "Leads and prioritizes cross-functional team activities.",
      "Builds relationships with executives throughout organization and establishes themselves as business partner in the development of customer based growth initiatives.",
      "Develops and presents communications (e.g., research findings, project recommendations) to senior management."
    ],
    "location": "Chicago area"
  },
  {
    "title": "Statistical Analyst, Segmentation Strategy",
    "responsibilities": [
      "Maximize file penetration and performance through development of new client file strategy, segmentation, and list selection.",
      "Ensure accurate execution of all statistical regression models developed by statisticians.",
      "Communicate with internal departments in a clear and timely manner.",
      "CPAM (Cost Per Acquired Member) & Budget",
      "Ensure monthly CPAM preparation for assigned client base.",
      "Accurately estimate annual member flow for yearly Budget process of Direct Marketing/TeleMarketing.",
      "Track campaign performance for ad-hoc reporting and statistical analysis.",
      "Chaid Modeling & Product Research.",
      "Build/plan Chaid and regression models prior to campaign date.",
      "Ensure accuracy of sample prepare requests and scoring programs.",
      "Update Scorecard monthly and Joblog weekly.",
      "Support company wide retention efforts and maximize lifetime value of members.",
      "Support Product, Strategy and Sales groups for all requests regarding market research, segmentation analysis and CRM."
    ],
    "requirements": [
      "MS in statistics or related disciplines (e.g., economics, sociology, demography, mathematics, computer sciences).",
      "Familiarity with PC spreadsheets: Excel, PowerPoint, Microsoft Word and Microsoft Access.",
      "Knowledge of techniques related to decision tree algorithms, such as CHAID and CART.",
      "Fluency in SAS environment - MVS, JCL,TSO."
    ]
  },
  {
    "title": "VP of Customer Operations",
    "summary": "This person will manage customer-facing teams and report directly to the CEO.\nAs a member of the executive team, this person will develop a strategy to drive revenue growth and extend the development of the organizations strategic offerings, superior technology and creative services by managing a group that includes; Strategic Account and Engagement Managers, Customer Support and Technical Consultants.",
    "responsibilities": [
      "Build, develop and lead a cohesive and effective team.",
      "Analyze customer needs and develop creative strategies to competitively address customers' business objectives and requirements.",
      "Oversee the delivery of major client accounts, ensuring the overall quality of service provided.",
      "Implement performance metrics for the compensation, incentive and recognition programs providing a consistent and qualitative correlation between performance and compensation.",
      "Develop forecasts, reports, and recommendations to enhance the growth and revenue opportunities.",
      "Design a service solution sales process and organize the professional services group around a product/solution focus."
    ],
    "location": "San Francisco, CA"
  },
  {
    "title": "Director of Email Strategy",
    "summary": "The Director of E-mail Strategy is responsible for leading the team to design the e-mail Strategy for a proposed client engagement (organic and new business). The Director of e-mail strategy is the lead developer of the plan or strategy but must work in collaboration with the client owner, the Technology, Communications and Analytic Strategists and key Subject Matter Experts (SMEs). This job acts as a key hand-off point for the Communications, Technology and Analytic Strategists as strategy is brought to life.",
    "requirements": [
      "Minimum requirements include 5+ years complex engagement consulting experience in a marketing, brand planning and management, Internet or new media environment encompassing e-business, experiential branding and application development.",
      "Proven working application of managing, developing and launching interactive/e-mail initiatives.",
      "Minimum requirements also include 2 years of experience in one or more of the following areas: Direct/Relationship Marketing, Interactive/New Media, Marketing, Advertising, or Production.",
      "Preferred requirements include an MBA.",
      "Understanding of Excel, Word, Email packages, PowerPoint, Project or other word-processing, tracking, and project management software.",
      "Possess an understanding of visual communications, creative development, web development process, marketing/advertising, and relational database technology.",
      "Ability to successfully present and translate emerging and changing technologies and subsequent impact on marketer's toolkit.",
      "Ability to exhibit confidence and courage and to challenge the status quo, looking for new ways to innovate and solve business issues."
    ],
    "location": "New York, NY"
  },
  {
    "title": "Marketing Manager",
    "responsibilities": [
      "Direct Mail Marketing.",
      "Establish Direct Mail marketing direction for assigned clients and products with the overall goal of maximizing profitability by media and product.",
      "Oversee marketing implementation from idea generation through analysis, recommendations and rollout.",
      "Develop testing plan for assigned media/clients. Identify new and unique marketing opportunities and prioritize testing across clients, products and channels.",
      "Reporting/Analysis of marketing results.",
      "Financial Reporting.",
      "Work closely with Business Development & Strategic Marketing, Sales, Product, Direct Mail Project Mgmt, Marketing Development to ensure effective resource utilization and opportunity maximization."
    ],
    "requirements": [
      "College degree preferred.",
      "Minimum 2 years of Marketing experience.",
      "Strong strategic, analytical and presentation skills.",
      "Excellent interpersonal, organizational and communication skills.",
      "Ability to interface effectively with all levels within organization.",
      "Ability to manage multiple competing priorities.",
      "Ability to manage multiple competing priorities.",
      "Proactive and ability to work independently."
    ]
  },
  {
    "title": "Manager of Consumer Research",
    "summary": "The Manager of Consumer Research is an integral part of the Market Research department. The role of the Manager is to develop and manage research methodologies in support of new product development, simulated test market tracking, post introduction tracking and various strategic research demands in support of marketing and business goals.\nYou will deliver relevant insights and solutions to enable strong guidance of brand and segment building efforts. Specific tasks include client service, planning, coordination, budgeting and management of the research process. This entails problem identification/definition and opportunity assessment by acquiring, analyzing, synthesizing and communicating relevant research information and implications to the business and recommending actions. Effective management and utilization of resources including personnel, budgets and time is imperative.",
    "requirements": [
      "Manager must have thorough understanding of basic and advanced consumer research methods, test marketing, brand and new brand tracking and sales/market analysis tools to understand the market place and consumer dynamics.",
      "Basic understanding of consumer volume estimation methods, statistical testing, data validation, and establishment of relevant benchmark perspectives and application of research information.",
      "Excellent problem solving/opportunity assessment/analytical skills.",
      "Applied knowledge with consumer research methods and information.",
      "Strong application of analytical technology tools (MS Word, Power Point, Excel, Lotus Notes, Internet tools and familiarity with SPSS).",
      "Exceptional communication skills (verbal/written/presentation).",
      "Work well with others, be proactive and take initiative with numerous internal Marketing, Sales, Senior Management clients and external research vendors.",
      "Strong team building, organizational, and rapid learning/application skills are essential."
    ],
    "location": "Southern Connecticut"
  },
  {
    "title": "Engagement Manager",
    "responsibilities": [
      "Business Development activities to market service offerings to existing customers and prospects.",
      "Primary customer contact, manage customer expectations and project deliverables.",
      "Manage all facets of the services engagement, from defining project scope and cost through project closure.",
      "Work with customers to develop campaign-specific e-marketing strategies.",
      "Ensure all projects are delivered on time and with in budget.",
      "Track all projects, develop necessary project plans, status reports, and conduct scheduled client meetings.",
      "Project issue management and appropriate escalation.",
      "Ensure client satisfaction with project deliverables.",
      "Create and manage a project infrastructure to support both the client and the team for each engagement that includes, but is not limited to timesheet accounting, project numbers, document/file repositories, project plans.",
      "document templates, issue tracking, status reporting, and meeting schedules.",
      "Monitor team time accounting to manage project delivery within budget.",
      "Identify and resolve any issues that arise on the engagement, scope or otherwise, in conjunction with the Account Manager and the customer."
    ],
    "requirements": [
      "Strong understanding of one or more industry segments.",
      "Ability to identify sales opportunities within existing customers.",
      "Ability to generate winning proposals/presentations.",
      "Strong work plan development skills.",
      "Strong work-plan execution skills for well scoped/static projects.",
      "Familiar with MS Project, other MS Office applications.",
      "Responsive to change."
    ],
    "location": "East/Central"
  },
  {
    "title": "Director of Customer Research",
    "summary": "Responsible for the development, delivery and application of actionable customer/shopping/brand insights to direct decision making and drive profitable sales for $55+Billion business. Entails leading research insights and implications at the national, regional, market and local (store) level across retail brand and sub-brands.\nPartners with Vice President to identify, understand and grow optimal target customer segments. Deliver compelling customer, shopping and brand insights to drive the strategic development of short and long-term company initiatives that deliver unmet customer needs. Develop tools/studies to monitor company performance against key customer experience metrics.",
    "responsibilities": [
      "Develop/execute holistic research plans that yield actionable customer insights to drive company strategies including brand and positioning.",
      "Partner with VP to create and develop operational innovative methods for identifying/tracking optimal customer experiences across the enterprise. Direct the development of customer touch-point programs through compelling customer/shopping/brand insights generation ensuring delivery of executional excellence.",
      "Analyze data to deliver knowledge that directs business decisions across the organization. Advocate voice of customer approach to drive strategy.",
      "Lead research efforts including optimization of marketing programs and media vehicles. Manage all aspects of project work regardless of scope.",
      "Lead/develop multiple direct reports, ensuring challenging environment which promotes career advancement through outstanding performance. Keep VP fully informed of organizational opportunities.",
      "Partner with VP to educate all levels of management on utility of research. Consistently demonstrate expertise in translating customer, shopping and brand insights into immediate application that drives profitable sales.",
      "Collaborate across departments (Marketing, Advertising Planning, Customer Experience, Merchandising, Store Ops, and Supply Chain) to anticipate emerging business needs. Demonstrate leadership through inherent understanding of prioritization to expertly manage demanding workload that meets business objectives.",
      "Consistently disseminate just-in-time applicable insights that enables organization to stay ahead of trends and relevant to customers.",
      "Manage research supplier relationships/budget.",
      "Direct advertising agency efforts consistent with customer/shopping/brand insights ensuring customer needs form the foundation and drive all work.",
      "Manage all external manufacturers? research efforts including approval of all studies/findings and the dissemination of insights aligned with company business objectives throughout the organization."
    ],
    "requirements": [
      "Minimum 10 years research experience in retail/consumer packaged goods industries required. Shopper/customer understanding and business development required. Background must include responsibility for business opportunity identification/strategic initiative development.",
      "Expertise across all research methodologies/mediums. Detailed understanding of all available techniques (including cost, timing, implications) to intuit and design research that delivers business needs.",
      "Possess strong analytic/strategic thinking capabilities. Strong negotiation skills and an ability to direct multiple/diverse external vendors, including research suppliers, advertising agencies and manufacturers."
    ],
    "location": "Chicago"
  }
]
